{
  "author": "arthuro 555 the good christian boi",
  "description": "Has a predefined list of bible verses and get some more random off the internet when it is available.\n\n\nIf you read this you got CHRISTIANISED. Read the whole bible to get UNCHRISTANIASED.\n\n\n\n\n\n\n\nrabbits are cool btw",
  "extensionNamespace": "",
  "fullName": "Bible Extension",
  "name": "Bible",
  "shortDescription": "Get a random bible verse!",
  "tags": "bible, verse, api, satan, holy, blessed extension",
  "version": "6.6.6",
  "eventsFunctions": [
    {
      "description": "",
      "fullName": "",
      "functionType": "Action",
      "name": "onFirstSceneLoaded",
      "sentence": "",
      "events": [
        {
          "disabled": false,
          "folded": false,
          "type": "BuiltinCommonInstructions::JsCode",
          "inlineCode": "gdjs.BIBLE = localStorage.getItem(\"BIBLE\");\n\ngdjs.BIBLE = gdjs.BIBLE ? JSON.parse(gdjs.BIBLE) : [\n    \"Numbers 4:36 and those of them numbered by their families were 2,750.\",\n    \"Genesis 44:31 When he sees the boy is not with us, he will die, and your servants will bring down the gray hair of your servant our father in sorrow to the grave.\",\n    \"Psalms 51:9 Hide your face from my sins!Wipe away all my guilt!\",\n    \"John 13:38 Jesus answered, “Will you lay down your life for me? I tell you the solemn truth, the rooster will not crow until you have denied me three times!\",\n    \"Hebrews 9:24 For Christ did not enter a sanctuary made with hands – the representation of the true sanctuary – but into heaven itself, and he appears now in God’s presence for us.\",\n    \"1 Corinthians 3:15 If someone’s work is burned up, he will suffer loss. He himself will be saved, but only as through fire.\",\n    \"1 Timothy 2:5 For there is one God and one intermediary between God and humanity, Christ Jesus, himself human,\",\n    \"Ezekiel 34:26 I will turn them and the regions around my hill into a blessing. I will make showers come down in their season; they will be showers that bring blessing.\",\n    \"Hebrews 1:1 After God spoke long ago in various portions and in various ways to our ancestors through the prophets, Hebrews 2 in these last days he has spoken to us in a son, whom he appointed heir of all things, and through whom he created the world. Hebrews 3 The Son is the radiance of his glory and the representation of his essence, and he sustains all things by his powerful word, and so when he had accomplished cleansing for sins, he sat down at the right hand of the Majesty on high. Hebrews 4 Thus he became so far better than the angels as he has inherited a name superior to theirs. Hebrews 5 For to which of the angels did God ever say, “You are my son! Today I have fathered you”? And in another place he says, “I will be his father and he will be my son.” Hebrews 6 But when he again brings his firstborn into the world, he says, “Let all the angels of God worship him!” Hebrews 7 And he says of the angels, “He makes his angels winds and his ministers a flame of fire,” Hebrews 8 but of the Son he says, “Your throne, O God, is forever and ever, and a righteous scepter is the scepter of your kingdom. Hebrews 9 You have loved righteousness and hated lawlessness.So God, your God, has anointed you over your companions with the oil of rejoicing.” Hebrews 10 And, “You founded the earth in the beginning, Lord, and the heavens are the works of your hands. Hebrews 11 They will perish, but you continue. And they will all grow old like a garment, Hebrews 12 and like a robe you will fold them upand like a garment they will be changed, but you are the same and your years will never run out.” Hebrews 13 But to which of the angels has he ever said, “Sit at my right hand until I make your enemies a footstool for your feet”? Hebrews 14 Are they not all ministering spirits, sent out to serve those who will inherit salvation? The Song of Songs 8:14 The Beloved to Her Lover: Make haste, my beloved!Be like a gazelle or a young stagon the mountains of spices.\",\n    \"Isaiah 54:14 You will be reestablished when I vindicate you. You will not experience oppression; indeed, you will not be afraid.You will not be terrified, for nothing frightening will come near you.\",\n    \"Judges 9:31 He sent messengers to Abimelech, who was in Arumah, reporting, “Beware! Gaal son of Ebed and his brothers are coming to Shechem and inciting the city to rebel against you.\",\n    \"Daniel 12:2 Many of those who sleepin the dusty ground will awake – some to everlasting life,and others to shame and everlasting abhorrence.\",\n    \"Jeremiah 28:2 “The Lord of Heaven’s Armies, the God of Israel says, ‘I will break the yoke of servitude to the king of Babylon.\",\n    \"Mark 12:2 At harvest time he sent a slave to the tenants to collect from them his portion of the crop.\",\n    \"1 Kings 6:27 He put the cherubim in the inner sanctuary of the temple. Their wings were spread out. One of the first cherub’s wings touched one wall and one of the other cherub’s wings touched the opposite wall. The first cherub’s other wing touched the second cherub’s other wing in the middle of the room.\",\n    \"Daniel 2:5 The king replied to the wise men, “My decision is firm. If you do not inform me of both the dream and its interpretation, you will be dismembered and your homes reduced to rubble!\",\n    \"1 Samuel 24:8 Afterward David got up and went out of the cave. He called out after Saul, “My lord, O king!” When Saul looked behind him, David kneeled down and bowed with his face to the ground.\",\n    \"Revelation 16:17 Finally the seventh angel poured out his bowl into the air and a loud voice came out of the temple from the throne, saying: “It is done!”\",\n    \"Proverbs 13:18 The one who neglects discipline ends up in poverty and shame,but the one who accepts reproof is honored.\",\n    \"2 Chronicles 5:12 All the Levites who were musicians, including Asaph, Heman, Jeduthun, and their sons and relatives, wore linen. They played cymbals and stringed instruments as they stood east of the altar. They were accompanied by 120 priests who blew trumpets.\",\n    \"1 Samuel 20:42 Jonathan said to David, “Go in peace, for the two of us have sworn together in the name of the Lord saying, ‘The Lord will be between me and you and between my descendants and your descendants forever.’”(21:1) Then David got up and left, while Jonathan went back to the city.\",\n    \"Ezekiel 33:4 but there is one who hears the sound of the trumpet yet does not heed the warning. Then the sword comes and sweeps him away. He will be responsible for his own death.\",\n    \"Jeremiah 1:5 “Before I formed you in your mother’s womb I chose you. Before you were born I set you apart.I appointed you to be a prophet to the nations.”\",\n    \"Jeremiah 23:4 I will install rulers over them who will care for them. Then they will no longer need to fear or be terrified. None of them will turn up missing. I, the Lord, promise it!\",\n    \"1 Samuel 26:5 So David set out and went to the place where Saul was camped. David saw the place where Saul and Abner son of Ner, the general in command of his army, were sleeping. Now Saul was lying in the entrenchment, and the army was camped all around him.\",\n    \"Leviticus 5:2 Or when there is a person who touches anything ceremonially unclean, whether the carcass of an unclean wild animal, or the carcass of an unclean domesticated animal, or the carcass of an unclean creeping thing, even if he did not realize it, but he himself has become unclean and is guilty;\",\n    \"2 Kings 25:19 From the city he took a eunuch who was in charge of the soldiers, five of the king’s advisers who were discovered in the city, an official army secretary who drafted citizens for military service, and sixty citizens from the people of the land who were discovered in the city.\",\n    \"Jeremiah 40:8 So all these officers and their troops came to Gedaliah at Mizpah. The officers who came were Ishmael son of Nethaniah, Johanan and Jonathan the sons of Kareah, Seraiah son of Tanhumeth, the sons of Ephai the Netophathite, and Jezaniah son of the Maacathite.\",\n    \"Ezekiel 18:21 “But if the wicked person turns from all the sin he has committed and observes all my statutes and does what is just and right, he will surely live; he will not die.\",\n    \"Acts 27:12 Because the harbor was not suitable to spend the winter in, the majority decided to put out to sea from there. They hoped that somehow they could reach Phoenix, a harbor of Crete facing southwest and northwest, and spend the winter there.\"\n];\n\nsetInterval(() => {\n    localStorage.setItem(\"BIBLE\", JSON.stringify(gdjs.BIBLE));\n    fetch(\"https://labs.bible.org/api/?passage=random&formatting=plain&type=text\")\n    .then(r => r.text())\n    .then(text => gdjs.BIBLE.push(text))\n    .catch(_ => true);\n}, gdjs.randomInRange(5, 10)*100);\n",
          "parameterObjects": "",
          "useStrict": true
        }
      ],
      "parameters": [],
      "objectGroups": []
    },
    {
      "description": "For christian bois",
      "fullName": "Get a random bible verse",
      "functionType": "StringExpression",
      "name": "GetRandomBibleVerse",
      "sentence": "",
      "events": [
        {
          "disabled": false,
          "folded": false,
          "type": "BuiltinCommonInstructions::JsCode",
          "inlineCode": "eventsFunctionContext.returnValue = gdjs.BIBLE[gdjs.randomInRange(0, gdjs.BIBLE.length)];",
          "parameterObjects": "",
          "useStrict": true
        }
      ],
      "parameters": [],
      "objectGroups": []
    }
  ],
  "eventsBasedBehaviors": []
}